Repository: moxi000/kelivo
Catalog: Kelivo-Swift/Kelivo/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# backupPageSelectImportModeDescription
source: Choose how to import the backup data:
zh_hans: 请选择如何导入备份数据：
zh_hant: 請選擇如何匯入備份資料：

# backupPageTestConnection
source: Test
zh_hans: 测试连接
zh_hant: 測試連線

# backupPageTestDone
source: Test done
zh_hans: 测试完成
zh_hant: 測試完成

# backupPageTitle
source: Backup & Restore
zh_hans: 备份与恢复
zh_hant: 備份與還原

# backupPageUsername
source: Username
zh_hans: 用户名
zh_hant: 使用者名稱

# backupPageWebDavBackup
source: WebDAV Backup
zh_hans: WebDAV 备份
zh_hant: WebDAV 備份

# backupPageWebDavServerSettings
source: WebDAV Server Settings
zh_hans: WebDAV 服务器设置
zh_hant: WebDAV 伺服器設定

# backupPageWebDavServerUrl
source: WebDAV Server URL
zh_hans: WebDAV 服务器地址
zh_hant: WebDAV 伺服器地址

# backupPageWebDavTab
source: WebDAV
zh_hans: WebDAV 备份
zh_hant: WebDAV 備份

# bottomToolsSheetCamera
source: Camera
zh_hans: 拍照
zh_hant: 拍照

# bottomToolsSheetClearContext
source: Clear Context
zh_hans: 清空上下文
zh_hant: 清空上下文

# bottomToolsSheetConfigurePrompt
source: Configure prompt
zh_hans: 设置提示词
zh_hant: 設定提示詞

# bottomToolsSheetLearningMode
source: Learning Mode
zh_hans: 学习模式
zh_hant: 學習模式

# bottomToolsSheetLearningModeDescription
source: Help you learn step by step
zh_hans: 帮助你循序渐进地学习知识
zh_hant: 幫助你循序漸進地學習知識

# bottomToolsSheetOcr
source: Image OCR
zh_hans: OCR 文字识别
zh_hant: OCR 文字辨識

# bottomToolsSheetPhotos
source: Photos
zh_hans: 照片
zh_hant: 照片

# bottomToolsSheetPrompt
source: Prompt
zh_hans: 提示词
zh_hant: 提示詞

# bottomToolsSheetPromptHint
source: Enter prompt text to inject
zh_hans: 输入要注入的提示词内容
zh_hant: 輸入要注入的提示詞內容

# bottomToolsSheetResetDefault
source: Reset to default
zh_hans: 重置为默认
zh_hant: 重設為預設

# bottomToolsSheetSave
source: Save
zh_hans: 保存
zh_hant: 儲存

# bottomToolsSheetUpload
source: Upload
zh_hans: 上传文件
zh_hant: 上傳檔案

# cameraPermissionDeniedMessage
source: Camera unavailable: permission not granted.
zh_hans: 未授予相机权限
zh_hant: 未授予相機權限

# chatHistoryPageCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# chatHistoryPageDelete
source: Delete
zh_hans: 删除
zh_hant: 刪除

# chatHistoryPageDeleteAllDialogContent
source: Delete every non-pinned conversation for this assistant? Pinned chats stay in place.
zh_hans: 确定要删除所有未置顶的对话吗？已置顶的将会保留。
zh_hant: 確認要刪除所有未置頂的對話嗎？已置頂的會保留。

# chatHistoryPageDeleteAllDialogTitle
source: Delete Unpinned Conversations
zh_hans: 删除未置顶对话
zh_hant: 刪除未置頂對話

# chatHistoryPageDeleteAllTooltip
source: Delete Unpinned
zh_hans: 删除未置顶
zh_hant: 刪除未置頂

# chatHistoryPageDeletedAllSnackbar
source: Unpinned conversations deleted
zh_hans: 已删除未置顶的对话
zh_hant: 已刪除未置頂的對話

# chatHistoryPageNoConversations
source: No conversations
zh_hans: 暂无对话
zh_hant: 暫無對話

# chatHistoryPagePin
source: Pin
zh_hans: 置顶
zh_hant: 置頂

# chatHistoryPagePinned
source: Pinned
zh_hans: 已置顶
zh_hant: 已置頂

# chatHistoryPagePinnedSection
source: Pinned
zh_hans: 置顶
zh_hant: 置頂

# chatHistoryPageSearchHint
source: Search conversations
zh_hans: 搜索对话
zh_hant: 搜尋對話

# chatHistoryPageSearchTooltip
source: Search
zh_hans: 搜索
zh_hant: 搜尋

# chatHistoryPageTitle
source: Chat History
zh_hans: 聊天历史
zh_hant: 聊天歷史

# chatInputBarCollapse
source: Collapse
zh_hans: 收起
zh_hant: 收起

# chatInputBarExpand
source: Expand
zh_hans: 展开
zh_hant: 展開

# chatInputBarHint
source: Type a message for AI
zh_hans: 输入消息与AI聊天
zh_hant: 輸入訊息與AI聊天

# chatInputBarInsertNewline
source: Newline
zh_hans: 换行
zh_hant: 換行

# chatInputBarMcpServersTooltip
source: MCP Servers
zh_hans: MCP服务器
zh_hant: MCP伺服器

# chatInputBarMoreTooltip
source: Add
zh_hans: 更多
zh_hant: 更多

# chatInputBarOcrTooltip
source: Image OCR
zh_hans: OCR 文字识别
zh_hant: OCR 文字辨識

# chatInputBarOnlineSearchTooltip
source: Online Search
zh_hans: 联网搜索
zh_hant: 聯網搜尋

# chatInputBarQuickPhraseTooltip
source: Quick Phrase
zh_hans: 快捷短语
zh_hant: 快捷片語

# chatInputBarReasoningStrengthTooltip
source: Reasoning Strength
zh_hans: 思维链强度
zh_hant: 思維鏈強度

# chatInputBarSelectModelTooltip
source: Select Model
zh_hans: 选择模型
zh_hant: 選擇模型

# chatMessageWidgetArguments
source: Arguments
zh_hans: 参数
zh_hant: 參數

# chatMessageWidgetBuiltinSearch
source: Built-in Search
zh_hans: 模型内置搜索
zh_hant: 模型內建搜尋

# chatMessageWidgetBuiltinSearchHideNote
source: Hide builtin search tool cards
zh_hans: 隐藏内置搜索工具卡片
zh_hant: 隱藏內建搜尋工具卡片

# chatMessageWidgetCannotOpenFile
source: Cannot open file: %@
zh_hans: 无法打开文件: %@
zh_hant: 無法開啟檔案: %@

# chatMessageWidgetCannotOpenUrl
source: Cannot open link: %@
zh_hans: 无法打开链接: %@
zh_hant: 無法開啟連結: %@

# chatMessageWidgetCitationNotFound
source: Citation source not found
zh_hans: 未找到引用来源
zh_hant: 未找到引用來源

# chatMessageWidgetCitationsCount
source: Citations (%lld)
zh_hans: 共%lld条引用
zh_hant: 共%lld條引用

# chatMessageWidgetCitationsTitle
source: Citations (%lld)
zh_hans: 引用（共%lld条）
zh_hant: 引用（共%lld條）

# chatMessageWidgetCopiedToClipboard
source: Copied to clipboard
zh_hans: 已复制到剪贴板
zh_hant: 已複製到剪貼簿

# chatMessageWidgetCreateMemory
source: Create Memory
zh_hans: 创建记忆
zh_hant: 建立記憶

# chatMessageWidgetDeepThinking
source: Deep Thinking
zh_hans: 深度思考
zh_hant: 深度思考

# chatMessageWidgetDeleteMemory
source: Delete Memory
zh_hans: 删除记忆
zh_hant: 刪除記憶

# chatMessageWidgetEditMemory
source: Edit Memory
zh_hans: 编辑记忆
zh_hant: 編輯記憶

# chatMessageWidgetFileNotFound
source: File not found: %@
zh_hans: 文件不存在: %@
zh_hant: 檔案不存在: %@

# chatMessageWidgetImages
source: Images
zh_hans: 图片
zh_hant: 圖片

# chatMessageWidgetMoreTooltip
source: More
zh_hans: 更多
zh_hant: 更多

# chatMessageWidgetNoResultYet
source: (No result yet)
zh_hans: （暂无结果）
zh_hant: （暫無結果）

# chatMessageWidgetOpenFileError
source: Failed to open file: %@
zh_hans: 打开文件失败: %@
zh_hant: 開啟檔案失敗: %@

# chatMessageWidgetOpenLinkError
source: Failed to open link
zh_hans: 打开链接失败
zh_hant: 開啟連結失敗

# chatMessageWidgetRegenerateConfirmCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# chatMessageWidgetRegenerateConfirmContent
source: Regenerating will overwrite all messages after this one and cannot be undone. Are you sure?
zh_hans: 重新生成将会覆盖此消息之后的所有消息，且无法撤销。确定要继续吗？
zh_hant: 重新生成將會覆蓋此訊息之後的所有訊息，且無法撤銷。確定要繼續嗎？

# chatMessageWidgetRegenerateConfirmOk
source: Regenerate
zh_hans: 重新生成
zh_hant: 重新生成

# chatMessageWidgetRegenerateConfirmTitle
source: Confirm Regenerate
zh_hans: 确认重新生成
zh_hant: 確認重新生成

# chatMessageWidgetRegenerateTooltip
source: Regenerate
zh_hans: 重新生成
zh_hant: 重新生成

# chatMessageWidgetResendTooltip
source: Resend
zh_hans: 重新发送
zh_hant: 重新傳送

# chatMessageWidgetResult
source: Result
zh_hans: 结果
zh_hant: 結果

# chatMessageWidgetSpeakTooltip
source: Speak
zh_hans: 朗读
zh_hant: 朗讀

# chatMessageWidgetStopTooltip
source: Stop
zh_hans: 停止
zh_hant: 停止

# chatMessageWidgetThinking
source: Thinking...
zh_hans: 正在思考...
zh_hant: 正在思考...

# chatMessageWidgetToolCall
source: Tool Call: %@
zh_hans: 调用工具: %@
zh_hant: 呼叫工具: %@

# chatMessageWidgetToolResult
source: Tool Result: %@
zh_hans: 调用工具: %@
zh_hant: 呼叫工具: %@

# chatMessageWidgetTranslateTooltip
source: Translate
zh_hans: 翻译
zh_hant: 翻譯

# chatMessageWidgetTranslating
source: Translating...
zh_hans: 翻译中...
zh_hant: 翻譯中...

# chatMessageWidgetTranslation
source: Translation
zh_hans: 翻译
zh_hant: 翻譯

# chatMessageWidgetWebSearch
source: Web Search: %@
zh_hans: 联网检索: %@
zh_hant: 聯網檢索: %@

# chatSelectionExportImage
source: Image
zh_hans: 图片
zh_hant: 圖片

# chatSelectionSelectedCountTitle
source: Selected %lld message(s)
zh_hans: 已选择%lld条消息
zh_hant: 已選擇%lld條訊息

# chatSelectionThinkingContent
source: Thinking content
zh_hans: 思考内容
zh_hant: 思考內容

# chatSelectionThinkingTools
source: Thinking tools
zh_hans: 思考工具
zh_hant: 思考工具

# chatServiceDefaultConversationTitle
source: New Chat
zh_hans: 新对话
zh_hant: 新對話

# clearContextDesc
source: Mark a context boundary
zh_hans: 标记上下文分界点
zh_hant: 標記上下文分界點

# codeBlockCollapsedLines
source: … %lld lines folded
zh_hans: … 已折叠 %lld 行
zh_hant: … 已摺疊 %lld 行

# codeBlockPreviewButton
source: Preview
zh_hans: 预览
zh_hant: 預覽

source: Compress Context
zh_hans: 压缩上下文
zh_hant: 壓縮上下文

# compressContextDesc
source: Summarize and start a new chat
zh_hans: 总结对话并开始新聊天
zh_hant: 總結對話並開始新聊天

# compressContextFailed
source: Failed to compress context
zh_hans: 压缩上下文失败
zh_hant: 壓縮上下文失敗

# compressContextNoMessages
source: No messages to compress
zh_hans: 没有可压缩的消息
zh_hant: 沒有可壓縮的訊息

source: Compressing context...
zh_hans: 正在压缩上下文...
zh_hant: 正在壓縮上下文...

source: Context Management
zh_hans: 上下文管理
zh_hant: 上下文管理

# defaultModelPageBackTooltip
source: Back
zh_hans: 返回
zh_hant: 返回

# defaultModelPageChatModelSubtitle
source: Global default chat model
zh_hans: 全局默认的聊天模型
zh_hant: 全域預設的聊天模型

# defaultModelPageChatModelTitle
source: Chat Model
zh_hans: 聊天模型
zh_hant: 聊天模型

# defaultModelPageOcrModelSubtitle
source: Used for extracting text and descriptions from images
zh_hans: 用于对图片执行文字识别的模型
zh_hant: 用於對圖片執行文字辨識的模型

# defaultModelPageOcrModelTitle
source: OCR Model
zh_hans: OCR 模型
zh_hant: OCR 模型

# defaultModelPageOcrPromptHint
source: Enter prompt template for OCR image understanding
zh_hans: 输入用于 OCR 识别的提示词模板
zh_hant: 輸入用於 OCR 辨識的提示詞範本

# defaultModelPagePromptLabel
source: Prompt
zh_hans: 提示词
zh_hant: 提示詞

# defaultModelPageResetDefault
source: Reset to default
zh_hans: 重置为默认
zh_hant: 重設為預設

# defaultModelPageSave
source: Save
zh_hans: 保存
zh_hant: 儲存

# defaultModelPageTitle
source: Default Model
zh_hans: 默认模型
zh_hant: 預設模型

# defaultModelPageTitleModelSubtitle
source: Used for summarizing conversation titles; prefer fast & cheap models
zh_hans: 用于总结对话标题的模型，推荐使用快速且便宜的模型
zh_hant: 用於總結對話標題的模型，推薦使用快速且便宜的模型

# defaultModelPageTitleModelTitle
source: Title Summary Model
zh_hans: 标题总结模型
zh_hant: 標題總結模型

# defaultModelPageTitlePromptHint
source: Enter prompt template for title summarization
zh_hans: 输入用于标题总结的提示词模板
zh_hant: 輸入用於標題總結的提示詞範本

# defaultModelPageTitleVars
source: Vars: content: %1$@, locale: %2$@
zh_hans: 变量: 对话内容: %1$@, 语言: %2$@
zh_hant: 變數: 對話內容: %1$@, 語言: %2$@

# defaultModelPageTranslateModelSubtitle
source: Used for translating message content; prefer fast & accurate models
zh_hans: 用于翻译消息内容的模型，推荐使用快速且准确的模型
zh_hant: 用於翻譯訊息內容的模型，推薦使用快速且準確的模型

# defaultModelPageTranslateModelTitle
source: Translation Model
zh_hans: 翻译模型
zh_hant: 翻譯模型

# defaultModelPageTranslatePromptHint
source: Enter prompt template for translation
zh_hans: 输入用于翻译的提示词模板
zh_hant: 輸入用於翻譯的提示詞範本

# defaultModelPageTranslateVars
source: Variables: source text: %1$@, target language: %2$@
zh_hans: 变量：原始文本：%1$@，目标语言：%2$@
zh_hant: 變數：原始文本：%1$@，目標語言：%2$@

# defaultModelPageUseCurrentModel
source: Use current chat model
zh_hans: 使用当前对话模型
zh_hant: 使用目前對話模型

# desktopAssistantsListTitle
source: Assistants
zh_hans: 助手列表
zh_hant: 助理列表

# desktopAvatarMenuChangeFromImage
source: Change from image…
zh_hans: 从图片更换…
zh_hant: 從圖片更換…

# desktopAvatarMenuReset
source: Reset avatar
zh_hans: 重置头像
zh_hant: 重置頭像

# desktopAvatarMenuUseEmoji
source: Use emoji
zh_hans: 使用表情符号
zh_hant: 使用表情符號

# desktopDisplaySettingsTopicPositionLeft
source: Left
zh_hans: 左侧
zh_hant: 左側

# desktopDisplaySettingsTopicPositionRight
source: Right
zh_hans: 右侧
zh_hant: 右側

# desktopDisplaySettingsTopicPositionTitle
source: Topic position
zh_hans: 话题位置
zh_hant: 主題位置

# desktopFontAppLabel
source: App Font
zh_hans: 应用字体
zh_hant: 應用字體

# desktopFontCodeLabel
source: Code Font
zh_hans: 代码字体
zh_hant: 程式碼字體

# desktopFontFamilyMonospaceDefault
source: Monospace
zh_hans: 系统默认
zh_hant: 系統預設

# desktopFontFamilySystemDefault
source: System Default
zh_hans: 系统默认
zh_hant: 系統預設

# desktopFontFilterHint
source: Filter fonts...
zh_hans: 输入以过滤字体…
zh_hant: 輸入以過濾字體…

# desktopFontLoading
source: Loading fonts…
zh_hans: 正在加载字体…
zh_hant: 正在載入字體…

# desktopNavChatTooltip
source: Chat
zh_hans: 聊天
zh_hant: 聊天

# desktopNavGlobalSearchTooltip
source: Global Search
zh_hans: 全局搜索
zh_hant: 全域搜尋

# desktopNavSettingsTooltip
source: Settings
zh_hans: 设置
zh_hant: 設定

# desktopNavStorageTooltip
source: Storage
zh_hans: 存储
zh_hant: 儲存

# desktopNavThemeToggleTooltip
source: Theme
zh_hans: 主题切换
zh_hant: 主題切換

# desktopNavTranslateTooltip
source: Translate
zh_hans: 翻译
zh_hant: 翻譯

# desktopProviderContextMenuShare
source: Share
zh_hans: 分享
zh_hant: 分享

# desktopProviderShareCopyQr
source: Copy QR
zh_hans: 复制二维码
zh_hant: 複製 QR 碼

# desktopProviderShareCopyText
source: Copy code
zh_hans: 复制文字
zh_hant: 複製文字

# desktopSettingsFontsTitle
source: Fonts
zh_hans: 字体设置
zh_hant: 字體設定

# desktopShowProviderInModelCapsule
source: Show provider in model capsule
zh_hans: 模型胶囊显示供应商
zh_hant: 模型膠囊顯示供應商

# desktopSidebarTabAssistants
source: Assistants
zh_hans: 助手
zh_hant: 助理

# desktopSidebarTabTopics
source: Topics
zh_hans: 话题
zh_hant: 主題

# desktopTrayMenuExit
source: Exit
zh_hans: 退出
zh_hant: 結束

# desktopTrayMenuShowWindow
source: Show Window
zh_hans: 显示窗口
zh_hant: 顯示視窗

# desktopTtsPleaseAddProvider
source: Please add a TTS provider first
zh_hans: 请先在设置中添加语音服务商
zh_hant: 請先在設定中新增語音服務商

# displaySettingsPageAndroidBackgroundChatTitle
source: Background Generation (Android)
zh_hans: 后台聊天生成
zh_hant: 後台聊天生成

# displaySettingsPageAppFontTitle
source: App Font
zh_hans: 应用字体
zh_hant: 應用字體

# displaySettingsPageAutoCollapseCodeBlockLinesTitle
source: Auto-collapse threshold
zh_hans: 超过多少行自动折叠
zh_hant: 超過多少行自動摺疊

# displaySettingsPageAutoCollapseCodeBlockLinesUnit
source: lines
zh_hans: 行
zh_hant: 行

# displaySettingsPageAutoCollapseCodeBlockTitle
source: Auto-collapse Code Blocks
zh_hans: 自动折叠代码块
zh_hant: 自動摺疊程式碼區塊

# displaySettingsPageAutoCollapseThinkingSubtitle
source: Collapse reasoning after finish
zh_hans: 思考完成后自动折叠，保持界面简洁
zh_hant: 思考完成後自動折疊，保持介面簡潔

# displaySettingsPageAutoCollapseThinkingTitle
source: Auto-collapse Thinking
zh_hans: 自动折叠思考
zh_hant: 自動折疊思考

# displaySettingsPageAutoScrollDisabledLabel
source: Off
zh_hans: 已关闭
zh_hant: 已關閉

# displaySettingsPageAutoScrollEnableTitle
source: Auto-scroll to bottom
zh_hans: 自动回到底部
zh_hant: 自動回到底部

# displaySettingsPageAutoScrollIdleSubtitle
source: Wait time after user scroll before jumping to bottom
zh_hans: 用户停止滚动后等待多久再自动回到底部
zh_hant: 使用者停止捲動後等待多久再自動回到底部

# displaySettingsPageAutoScrollIdleTitle
source: Auto-Scroll Back Delay
zh_hans: 自动回到底部延迟
zh_hant: 自動回到底部延遲

# displaySettingsPageAutoSwitchTopicsTitle
source: Auto switch to Topics
zh_hans: 自动切换话题
zh_hant: 自動切換話題

# displaySettingsPageBehaviorStartupTitle
source: Behavior & startup
zh_hans: 行为与启动
zh_hant: 行為與啟動

# displaySettingsPageChatBackgroundMaskTitle
source: Chat Background Overlay Opacity
zh_hans: 背景图片遮罩透明度
zh_hant: 聊天背景遮罩透明度

# displaySettingsPageChatFontSampleText
source: This is a sample chat text
zh_hans: 这是一个示例的聊天文本
zh_hant: 這是一個範例的聊天文本

# displaySettingsPageChatFontSizeTitle
source: Chat Font Size
zh_hans: 聊天字体大小
zh_hant: 聊天字體大小

# displaySettingsPageChatItemDisplayTitle
source: Chat item display
zh_hans: 聊天项显示
zh_hant: 聊天項顯示

# displaySettingsPageChatMessageBackgroundDefault
source: Default
zh_hans: 默认
zh_hant: 預設

# displaySettingsPageChatMessageBackgroundFrosted
source: Frosted Glass
zh_hans: 模糊
zh_hant: 模糊

# displaySettingsPageChatMessageBackgroundSolid
source: Solid Color
zh_hans: 纯色
zh_hant: 純色

# displaySettingsPageChatMessageBackgroundTitle
source: Chat Message Background
zh_hans: 聊天消息背景
zh_hant: 聊天訊息背景

# displaySettingsPageChatModelIconSubtitle
source: Show model icon in chat messages
zh_hans: 是否在聊天消息中显示模型图标
zh_hant: 是否在聊天訊息中顯示模型圖示

# displaySettingsPageChatModelIconTitle
source: Chat Model Icon
zh_hans: 聊天列表模型图标
zh_hant: 聊天列表模型圖示

# displaySettingsPageCodeFontTitle
source: Code Font
zh_hans: 代码字体
zh_hant: 程式碼字體

# displaySettingsPageEnableAssistantMarkdownTitle
source: Render assistant messages with Markdown
zh_hans: 助手消息 Markdown 渲染
zh_hant: 助手訊息 Markdown 渲染

# displaySettingsPageEnableDollarLatexSubtitle
source: Render inline math inside $...$
zh_hans: 将 $...$ 之间的内容按行内数学公式渲染
zh_hant: 將 $...$ 之間的內容以行內數學公式渲染

# displaySettingsPageEnableDollarLatexTitle
source: Inline $...$ Rendering
zh_hans: 启用 $...$ 渲染
zh_hant: 啟用 $...$ 渲染

# displaySettingsPageEnableMathSubtitle
source: Render LaTeX math (inline and block)
zh_hans: 渲染 LaTeX 数学公式（行内与块级）
zh_hant: 渲染 LaTeX 數學公式（行內與區塊）

# displaySettingsPageEnableMathTitle
source: Math Formula Rendering
zh_hans: 启用数学公式渲染
zh_hant: 啟用數學公式渲染

# displaySettingsPageEnableReasoningMarkdownTitle
source: Render reasoning (thinking) with Markdown
zh_hans: 思维链 Markdown 渲染
zh_hant: 思维鏈 Markdown 渲染

# displaySettingsPageEnableUserMarkdownTitle
source: Render user messages with Markdown
zh_hans: 用户消息 Markdown 渲染
zh_hant: 使用者訊息 Markdown 渲染

# displaySettingsPageEnterToSendTitle
source: Enter Key to Send
zh_hans: 回车键发送消息
zh_hant: 回車鍵發送訊息

# displaySettingsPageFontLocalFileLabel
source: Local file
zh_hans: 本地文件
zh_hant: 本機檔案

# displaySettingsPageFontResetLabel
source: Reset font settings
zh_hans: 恢复默认
zh_hant: 回復預設設定

# displaySettingsPageHapticsGlobalTitle
source: Global Haptics
zh_hans: 全局触觉反馈
zh_hant: 全域觸覺回饋

# displaySettingsPageHapticsIosSwitchTitle
source: Haptics on Switch
zh_hans: 开关触觉反馈
zh_hant: 開關觸覺回饋

# displaySettingsPageHapticsOnCardTapTitle
source: Haptics on Cards
zh_hans: 卡片触觉反馈
zh_hant: 卡片點擊觸覺回饋

# displaySettingsPageHapticsOnGenerateSubtitle
source: Enable haptic feedback during generation
zh_hans: 生成消息时启用触觉反馈
zh_hant: 生成訊息時啟用觸覺回饋

# displaySettingsPageHapticsOnGenerateTitle
source: Haptics on Generate
zh_hans: 消息生成触觉反馈
zh_hant: 訊息生成觸覺回饋

# displaySettingsPageHapticsOnListItemTapTitle
source: Haptics on List Items
zh_hans: 列表项触觉反馈
zh_hant: 列表項點擊觸覺回饋

# displaySettingsPageHapticsOnSidebarSubtitle
source: Enable haptic feedback when opening/closing sidebar
zh_hans: 打开/关闭侧边栏时启用触觉反馈
zh_hant: 開啟/關閉側邊欄時啟用觸覺回饋

# displaySettingsPageHapticsOnSidebarTitle
source: Haptics on Sidebar
zh_hans: 侧边栏触觉反馈
zh_hant: 側邊欄觸覺回饋

# displaySettingsPageHapticsSettingsTitle
source: Haptics
zh_hans: 触觉反馈
zh_hant: 觸覺回饋

# displaySettingsPageKeepAssistantListExpandedOnSidebarCloseTitle
source: Don't collapse assistant list when closing sidebar
zh_hans: 关闭侧边栏时不折叠助手列表
zh_hant: 關閉側邊欄時不折疊助手列表

# displaySettingsPageKeepSidebarOpenOnAssistantTapTitle
source: Keep sidebar open when selecting assistant
zh_hans: 点选助手时不自动关闭侧边栏
zh_hant: 點選助手時不自動關閉側邊欄

# displaySettingsPageKeepSidebarOpenOnTopicTapTitle
source: Keep sidebar open when selecting topic
zh_hans: 点选话题时不自动关闭侧边栏
zh_hant: 點選話題時不自動關閉側邊欄

# displaySettingsPageLanguageChineseLabel
source: Simplified Chinese
zh_hans: 简体中文
zh_hant: 简体中文

# displaySettingsPageLanguageSubtitle
source: Choose interface language
zh_hans: 选择界面语言
zh_hant: 選擇介面語言

# displaySettingsPageLanguageTitle
source: App Language
zh_hans: 应用语言
zh_hant: 應用程式語言

# displaySettingsPageMessageNavButtonsSubtitle
source: Show quick jump buttons when scrolling
zh_hans: 滚动时显示快速跳转按钮
zh_hant: 滾動時顯示快速跳轉按鈕

# displaySettingsPageMessageNavButtonsTitle
source: Message Navigation Buttons
zh_hans: 消息导航按钮
zh_hant: 訊息導航按鈕

# displaySettingsPageMobileCodeBlockWrapTitle
source: Mobile Code Block Word Wrap
zh_hans: 移动端代码块自动换行
zh_hant: 行動端程式碼區塊自動換行

# displaySettingsPageNewChatAfterDeleteTitle
source: New chat after deleting topic
zh_hans: 删除话题后新建对话
zh_hant: 刪除話題後新建對話

# displaySettingsPageNewChatOnAssistantSwitchTitle
source: New chat when switching assistants
zh_hans: 切换助手时新建对话
zh_hant: 切換助理時新建對話

# displaySettingsPageNewChatOnLaunchSubtitle
source: Automatically create a new chat on launch
zh_hans: 应用启动时自动创建新对话
zh_hant: 應用程式啟動時自動建立新對話

# displaySettingsPageNewChatOnLaunchTitle
source: New Chat on Launch
zh_hans: 启动时新建对话
zh_hant: 啟動時新建對話

# displaySettingsPageOtherSettingsTitle
source: Other Settings
zh_hans: 其他设置
zh_hant: 其他設定

# displaySettingsPageRenderingSettingsTitle
source: Rendering settings
zh_hans: 渲染设置
zh_hant: 渲染設定

# displaySettingsPageSendShortcutTitle
source: Send Shortcut
zh_hans: 发送快捷键
zh_hant: 發送快捷鍵

# displaySettingsPageShowChatListDateSubtitle
source: Display date group labels in the conversation list
zh_hans: 在左侧对话列表中显示日期分组标签
zh_hant: 在左側對話列表中顯示日期分組標籤

# displaySettingsPageShowChatListDateTitle
source: Show Chat List Dates
zh_hans: 显示对话列表日期
zh_hant: 顯示對話列表日期

# displaySettingsPageShowModelNameTimestampSubtitle
source: Show model name and the timestamp below it in chat messages
zh_hans: 是否在聊天消息中显示模型名称和时间戳
zh_hant: 是否在聊天訊息中顯示模型名稱及時間戳

# displaySettingsPageShowModelNameTimestampTitle
source: Show Model Name & Timestamp
zh_hans: 显示模型名称和时间戳
zh_hant: 顯示模型名稱與時間戳

# displaySettingsPageShowProviderInChatMessageSubtitle
source: Display provider name after the model ID in chat messages (e.g. model | provider)
zh_hans: 在聊天消息的模型名称后面显示供应商名称（如 模型 | 供应商）
zh_hant: 在聊天訊息的模型名稱後面顯示供應商名稱（如 模型 | 供應商）

# displaySettingsPageShowProviderInChatMessageTitle
source: Show Provider After Model Name
zh_hans: 模型名称后显示供应商
zh_hant: 模型名稱後顯示供應商

# displaySettingsPageShowTokenStatsSubtitle
source: Show token usage and message count
zh_hans: 显示 token 用量与消息数量
zh_hant: 顯示 token 用量與訊息數量

# displaySettingsPageShowTokenStatsTitle
source: Show Token & Context Stats
zh_hans: 显示Token和上下文统计
zh_hant: 顯示Token和上下文統計

# displaySettingsPageShowUpdatesSubtitle
source: Show app update notifications
zh_hans: 显示应用更新通知
zh_hant: 顯示應用程式更新通知

# displaySettingsPageShowUpdatesTitle
source: Show Updates
zh_hans: 显示更新
zh_hant: 顯示更新

# displaySettingsPageShowUserAvatarSubtitle
source: Display user avatar in chat messages
zh_hans: 是否在聊天消息中显示用户头像
zh_hant: 是否在聊天訊息中顯示使用者頭像

# displaySettingsPageShowUserAvatarTitle
source: Show User Avatar
zh_hans: 显示用户头像
zh_hant: 顯示使用者頭像

# displaySettingsPageShowUserMessageActionsSubtitle
source: Display copy, resend, and more buttons below your messages
zh_hans: 在用户消息下方显示复制、重发与更多按钮
zh_hant: 在使用者訊息下方顯示複製、重傳與更多按鈕

# displaySettingsPageShowUserMessageActionsTitle
source: Show User Message Actions
zh_hans: 显示用户消息操作按钮
zh_hant: 顯示使用者訊息操作按鈕

# displaySettingsPageShowUserNameTimestampSubtitle
source: Show user name and the timestamp below it in chat messages
zh_hans: 是否在聊天消息中显示用户名称和时间戳
zh_hant: 是否在聊天訊息中顯示使用者名稱以時間戳

# displaySettingsPageShowUserNameTimestampTitle
source: Show User Name & Timestamp
zh_hans: 显示用户名称和时间戳
zh_hant: 顯示使用者名稱與時間戳

# displaySettingsPageThemeColorTitle
source: Theme Color
zh_hans: 主题颜色
zh_hant: 主題顏色

# displaySettingsPageThemeSettingsTitle
source: Theme Settings
zh_hans: 主题设置
zh_hant: 主題設定

# displaySettingsPageTrayMinimizeOnCloseTitle
source: Minimize to tray on close
zh_hans: 关闭时最小化到托盘
zh_hant: 關閉視窗時最小化到系統匣

# displaySettingsPageTrayShowTrayTitle
source: Show tray icon
zh_hans: 显示托盘图标
zh_hant: 顯示系統匣圖示

# displaySettingsPageTrayTitle
source: System Tray
zh_hans: 托盘
zh_hant: 系統匣

# exportDisclaimerAiGenerated
source: Content generated by AI. Please verify carefully.
zh_hans: 内容由 AI 生成，请仔细甄别
zh_hant: 內容由 AI 生成，請仔細甄別

# fileUploadDuplicateContent
source: A file named %@ already exists. Use the existing file?
zh_hans: 检测到同名文件 %@，是否使用现有文件？
zh_hant: 偵測到同名檔案 %@，是否使用現有檔案？

# fileUploadDuplicateTitle
source: File already exists
zh_hans: 文件已存在
zh_hant: 檔案已存在

# fileUploadDuplicateUploadNew
source: Upload new
zh_hans: 重新上传
zh_hant: 重新上傳

# fileUploadDuplicateUseExisting
source: Use existing
zh_hans: 使用现有
zh_hant: 使用現有

# flutterLogSettingSubtitle
source: When enabled, Flutter errors and print output are written to logs/flutter_logs.txt (rotated daily).
zh_hans: 开启后会将 Flutter 错误与 print 输出写入 logs/flutter_logs.txt
zh_hant: 開啟後會將 Flutter 錯誤與 print 輸出寫入 logs/flutter_logs.txt

# flutterLogSettingTitle
source: Flutter Logging
zh_hans: 应用日志打印
zh_hant: Flutter日誌列印

# fontPickerChooseLocalFile
source: Choose Local File
zh_hans: 选择本地文件
zh_hant: 選擇本機檔案

# fontPickerFilterHint
source: Filter fonts...
zh_hans: 输入以过滤字体…
zh_hant: 輸入以過濾字體…

# fontPickerGetFromGoogleFonts
source: Browse Google Fonts
zh_hans: 从 Google Fonts 获取
zh_hant: 從 Google Fonts 取得

source: Generation interrupted
zh_hans: 生成已中断
zh_hant: 生成已中斷

source: Hello World!
zh_hans: 你好，世界！
zh_hant: 你好，世界！

# homePageCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# homePageClearContext
source: Clear Context
zh_hans: 清空上下文
zh_hant: 清空上下文

# homePageClearContextWithCount
source: Clear Context (%1$@/%2$@)
zh_hans: 清空上下文 (%1$@/%2$@)
zh_hant: 清空上下文 (%1$@/%2$@)

# homePageDefaultAssistant
source: Default Assistant
zh_hans: 默认助手
zh_hant: 預設助理

# homePageDelete
source: Delete
zh_hans: 删除
zh_hant: 刪除
